#!/bin/bash

################################################################################
# ヘッダ・ファイルcamera_index_ov2640.hをHTMLファイルに逆変換するツールです
# 実行には、gzipとPython 3の実行環境が必要です．
#
# camera_index_ov2640.h → camera_index_ov2640.html
#
################################################################################
# 使用、改変、再配布は自由に行えますが、無保証です。権利情報の改変は不可です。
# Copyright (c) 2020 Wataru KUNINO
################################################################################

../tools/header2gz.py ../CameraWebServer/camera_index_ov2640.h
gzip -d camera_index_ov2640.html.gz
